In [ ]:
import requests
from bs4 import BeautifulSoup as beau
import sqlite3
import pandas as pd

In [ ]:
url = "http://books.toscrape.com"
response = requests.get(url)
print(response.text)

In [ ]:
soup = beau(response.text , 'html.parser')
connection = sqlite3.connect("Books.db")
cursor = connection.cursor()

createTable = "CREATE TABLE if not exists books(title varchar(255), price int, rating varchar(255) , numrate int ,category_name varchar(255), category_id int , categoryitems int )"
cursor.execute(createTable)
createTable = "CREATE TABLE if not exists category(name varchar(255), id int)"
cursor.execute(createTable)
for i in range(3 , 52):
    print(f'step number {i}')
    cate_url = url +"/"+ soup.find_all("li")[i].find('a').attrs['href']
    response_cate = requests.get(cate_url)
    soup_cate = beau(response_cate.text , 'html.parser')
    cate_name= soup_cate.find_all("strong")[0].get_text()
    sql = "INSERT INTO category (name,id) VALUES (?,?)"
    data = [cate_name,i]
    cursor.execute(sql, data)
    print(f'Category name : {cate_name}')
    items_number = int(soup_cate.find_all("strong")[1].get_text())
    print(f'Books count in this Category : {items_number}')
    if items_number > 20:
        items_number = 20
    x =soup_cate.find_all('article', attrs={'class':'product_pod'})
    for ele in range(items_number):
        
        title = x[ele].find('h3').find('a').attrs['title']
        price = x[ele].find('p', attrs={'class':'price_color'}).get_text()[2:]
        rating = x[ele].find('p').attrs['class'][1]
        if rating == "One":
            numrate = 1
        elif rating == "Two":
            numrate = 2
        elif rating == "Three":
            numrate = 3
        elif rating == "Four":
            numrate = 4
        elif rating == "Five":
            numrate = 5
        sql = "INSERT INTO books (title,price,rating,numrate, category_name ,category_id  ,categoryitems) VALUES (?,?,?,?,?,?,?)"
        data = [title,price,rating ,numrate ,cate_name,i,items_number]
        cursor.execute(sql, data)
        connection.commit()
    print(f'\n************************')
    
        
connection.close()

step number 3
Category name : Travel
Books count in this Category : 11

************************
step number 4
Category name : Mystery
Books count in this Category : 32

************************
step number 5
Category name : Historical Fiction
Books count in this Category : 26

************************
step number 6
Category name : Sequential Art
Books count in this Category : 75

************************
step number 7
Category name : Classics
Books count in this Category : 19

************************
step number 8
Category name : Philosophy
Books count in this Category : 11

************************
step number 9
Category name : Romance
Books count in this Category : 35

************************
step number 10
Category name : Womens Fiction
Books count in this Category : 17

************************
step number 11
Category name : Fiction
Books count in this Category : 65

************************
step number 12
Category name : Childrens
Books count in this Category : 29

************************
step number 13
Category name : Religion
Books count in this Category : 7

************************
step number 14
Category name : Nonfiction
Books count in this Category : 110

************************
step number 15
Category name : Music
Books count in this Category : 13

************************
step number 16
Category name : Default
Books count in this Category : 152

************************
step number 17
Category name : Science Fiction
Books count in this Category : 16

************************
step number 18
Category name : Sports and Games
Books count in this Category : 5

************************
step number 19
Category name : Add a comment
Books count in this Category : 67

************************
step number 20
Category name : Fantasy
Books count in this Category : 48

************************
step number 21
Category name : New Adult
Books count in this Category : 6

************************
step number 22
Category name : Young Adult
Books count in this Category : 54

************************
step number 23
Category name : Science
Books count in this Category : 14

************************
step number 24
Category name : Poetry
Books count in this Category : 19

************************
step number 25
Category name : Paranormal
Books count in this Category : 1

************************
step number 26
Category name : Art
Books count in this Category : 8

************************
step number 27
Category name : Psychology
Books count in this Category : 7

************************
step number 28
Category name : Autobiography
Books count in this Category : 9

************************
step number 29
Category name : Parenting
Books count in this Category : 1

************************
step number 30
Category name : Adult Fiction
Books count in this Category : 1

************************
step number 31
Category name : Humor
Books count in this Category : 10

************************
step number 32
Category name : Horror
Books count in this Category : 17

************************
step number 33
Category name : History
Books count in this Category : 18

************************
step number 34
Category name : Food and Drink
Books count in this Category : 30

************************
step number 35
Category name : Christian Fiction
Books count in this Category : 6

************************
step number 36
Category name : Business
Books count in this Category : 12

************************
step number 37
Category name : Biography
Books count in this Category : 5

************************
step number 38
Category name : Thriller
Books count in this Category : 11

************************
step number 39
Category name : Contemporary
Books count in this Category : 3

************************
step number 40
Category name : Spirituality
Books count in this Category : 6

************************
step number 41
Category name : Academic
Books count in this Category : 1

************************
step number 42
Category name : Self Help
Books count in this Category : 5

************************
step number 43
Category name : Historical
Books count in this Category : 2

************************
step number 44
Category name : Christian
Books count in this Category : 3

************************
step number 45
Category name : Suspense
Books count in this Category : 1

************************
step number 46
Category name : Short Stories
Books count in this Category : 1

************************
step number 47
Category name : Novels
Books count in this Category : 1

************************
step number 48
Category name : Health
Books count in this Category : 4

************************
step number 49
Category name : Politics
Books count in this Category : 3

************************
step number 50
Category name : Cultural
Books count in this Category : 1

************************
step number 51
Category name : Erotica
Books count in this Category : 1

************************

# 01

In [ ]:
connection = sqlite3.connect("Books.db")
df = pd.read_sql("SELECT * FROM books WHERE numrate >= 3", connection)
df

                                                 title  ...  categoryitems
0    Full Moon over Noahâs Ark: An Odyssey to Mou...  ...             11
1    See America: A Celebration of Our National Par...  ...             11
2                                 Under the Tuscan Sun  ...             11
3                     A Year in Provence (Provence #1)  ...             11
4            Neither Here nor There: Travels in Europe  ...             11
..                                                 ...  ...            ...
285  The Bulletproof Diet: Lose up to a Pound a Day...  ...              4
286  10-Day Green Smoothie Cleanse: Lose Up to 15 P...  ...              4
287     The Art and Science of Low Carbohydrate Living  ...              4
288  Why the Right Went Wrong: Conservatism--From G...  ...              3
289                                         Dark Notes  ...              1

[290 rows x 7 columns]

# 02

In [ ]:
df = pd.read_sql("SELECT * FROM books WHERE numrate >= 3 OR price > 20 ", connection)
df

                                                 title  ...  categoryitems
0                              It's Only the Himalayas  ...             11
1    Full Moon over Noahâs Ark: An Odyssey to Mou...  ...             11
2    See America: A Celebration of Our National Par...  ...             11
3    Vagabonding: An Uncommon Guide to the Art of L...  ...             11
4                                 Under the Tuscan Sun  ...             11
..                                                 ...  ...            ...
470                       Libertarianism for Beginners  ...              3
471  Why the Right Went Wrong: Conservatism--From G...  ...              3
472  Equal Is Unfair: America's Misguided Fight Aga...  ...              3
473                                     Amid the Chaos  ...              1
474                                         Dark Notes  ...              1

[475 rows x 7 columns]

# 03

In [ ]:
df = pd.read_sql("SELECT * FROM books WHERE rating !='Three'", connection)
df

                                                 title  ...  categoryitems
0                              It's Only the Himalayas  ...             11
1    Full Moon over Noahâs Ark: An Odyssey to Mou...  ...             11
2    Vagabonding: An Uncommon Guide to the Art of L...  ...             11
3                                   A Summer In Europe  ...             11
4                             The Great Railway Bazaar  ...             11
..                                                 ...  ...            ...
413                       Libertarianism for Beginners  ...              3
414  Why the Right Went Wrong: Conservatism--From G...  ...              3
415  Equal Is Unfair: America's Misguided Fight Aga...  ...              3
416                                     Amid the Chaos  ...              1
417                                         Dark Notes  ...              1

[418 rows x 7 columns]

# 04

In [ ]:
df = pd.read_sql("SELECT * FROM books WHERE rating IN ('Four' , 'One' , 'Three') AND price BETWEEN 10 AND 40 ", connection)
df

                                                 title  ...  categoryitems
0                                 Under the Tuscan Sun  ...             11
1                             The Great Railway Bazaar  ...             11
2    The Road to Little Dribbling: Adventures of an...  ...             11
3            Neither Here nor There: Travels in Europe  ...             11
4                                 In a Dark, Dark Wood  ...             20
..                                                 ...  ...            ...
176  You Are a Badass: How to Stop Doubting Your Gr...  ...              5
177  The Girl You Left Behind (The Girl You Left Be...  ...              2
178  Blue Like Jazz: Nonreligious Thoughts on Chris...  ...              3
179                                        The Grownup  ...              1
180                                     Amid the Chaos  ...              1

[181 rows x 7 columns]

# 05

In [ ]:
df = pd.read_sql("SELECT * FROM books ORDER BY price DESC LIMIT 5 ", connection)
df

                                               title  ...  categoryitems
0                 The Perfect Play (Play by Play #1)  ...             20
1                   Civilization and Its Discontents  ...              7
2  The Bone Hunters (Lexy Vaughan & Steven Macaul...  ...             11
3  Thomas Jefferson and the Tripoli Pirates: The ...  ...             18
4                      Boar Island (Anna Pigeon #19)  ...             20

[5 rows x 7 columns]

# 06

In [ ]:
df = pd.read_sql("SELECT * FROM books ORDER BY numrate DESC , price ASC LIMIT 3,10" , connection)
df

                                               title  ...  categoryitems
0                  Walt Disney's Alice in Wonderland  ...             20
1   Princess Between Worlds (Wide-Awake Princess #5)  ...             20
2  Princess Jellyfish 2-in-1 Omnibus, Vol. 01 (Pr...  ...             20
3                                         Some Women  ...             17
4                     The Epidemic (The Program 0.6)  ...             20
5   A Gentleman's Position (Society of Gentlemen #3)  ...             20
6  Hyperbole and a Half: Unfortunate Situations, ...  ...             10
7               Fifty Shades Freed (Fifty Shades #3)  ...              1
8  The Collected Poems of W.B. Yeats (The Collect...  ...             19
9                                     Sophie's World  ...             11

[10 rows x 7 columns]

# 07

In [ ]:
cursor = connection.cursor()
for item in range(5):
    
    sql = "INSERT INTO books (title,price,rating,numrate, category_name ,category_id  ,categoryitems) VALUES (?,?,?,?,?,?,?)"
    data = ["book {item}" ,item *10,"one" ,1 ,"Epsilon",52,5]
    cursor.execute(sql, data)
    connection.commit()
print("Done")

Done

# 08

In [ ]:
sql = "Update books SET title = 'Ahmed Book' , price = 20 WHERE numrate = 3 AND price <20"
cursor.execute(sql)
connection.commit()
df = pd.read_sql("SELECT * FROM books WHERE numrate = 3 AND price = 20" , connection)
df

         title  price rating  ...       category_name category_id  categoryitems
0   Ahmed Book     20  Three  ...             Mystery           4             20
1   Ahmed Book     20  Three  ...  Historical Fiction           5             20
2   Ahmed Book     20  Three  ...      Sequential Art           6             20
3   Ahmed Book     20  Three  ...            Classics           7             19
4   Ahmed Book     20  Three  ...             Romance           9             20
5   Ahmed Book     20  Three  ...      Womens Fiction          10             17
6   Ahmed Book     20  Three  ...           Childrens          12             20
7   Ahmed Book     20  Three  ...          Nonfiction          14             20
8   Ahmed Book     20  Three  ...               Music          15             13
9   Ahmed Book     20  Three  ...             Default          16             20
10  Ahmed Book     20  Three  ...       Add a comment          19             20
11  Ahmed Book     20  Three  ...             Fantasy          20             20
12  Ahmed Book     20  Three  ...             Science          23             14
13  Ahmed Book     20  Three  ...              Horror          32             17
14  Ahmed Book     20  Three  ...             History          33             18
15  Ahmed Book     20  Three  ...             History          33             18
16  Ahmed Book     20  Three  ...           Self Help          42              5

[17 rows x 7 columns]

# 09

In [ ]:
sql = "DELETE FROM books WHERE price > 50 AND numrate <= 2"
cursor.execute(sql)
connection.commit()
df = pd.read_sql("SELECT * FROM books WHERE numrate <= 2 AND price > 50" , connection)
df

Empty DataFrame
Columns: [title, price, rating, numrate, category_name, category_id, categoryitems]
Index: []

# 10

In [ ]:
df = pd.read_sql("SELECT Count(*) FROM books WHERE title LIKE '%secret%' AND price BETWEEN 10 AND 20" , connection)
df

   Count(*)
0         2

# 11

In [ ]:
pdmix = pd.read_sql("SELECT MAX(price) FROM books WHERE numrate = 5" , connection)
dfmin= pd.read_sql("SELECT MIN(price) FROM books WHERE numrate = 5" , connection)
df ,dfmin

(   Count(*)
 0         2,    MIN(price)
 0       11.38)

# 12

In [ ]:
df = pd.read_sql("SELECT AVG(price) FROM books WHERE numrate = 5" , connection)
df

   AVG(price)
0   35.789231

# 13

In [ ]:
df = pd.read_sql("SELECT SUM(price) FROM books WHERE numrate = 2 AND price BETWEEN 10 AND 40" , connection)
df

   SUM(price)
0     1641.07

# 14

In [ ]:
df = pd.read_sql("SELECT books.category_name , category.name , books.rating FROM books INNER JOIN category ON books.category_name = category.name" , connection)
df

    category_name      name rating
0          Travel    Travel    Two
1          Travel    Travel   Four
2          Travel    Travel  Three
3          Travel    Travel    Two
4          Travel    Travel  Three
..            ...       ...    ...
469        Health    Health   Five
470        Health    Health   Five
471      Politics  Politics   Four
472      Cultural  Cultural    One
473       Erotica   Erotica   Five

[474 rows x 3 columns]

# 15

In [ ]:
df = pd.read_sql("SELECT COUNT(rating) FROM books WHERE price BETWEEN 20 AND 30" , connection)
df

   COUNT(rating)
0            128

# 16

In [ ]:
df = pd.read_sql("SELECT COUNT(category_name) FROM books WHERE categoryitems > 10" , connection)
df

   COUNT(category_name)
0                   383

# 17

In [ ]:
df = pd.read_sql("SELECT * FROM books WHERE category_name = (SELECT category_name from books WHERE category_name = 'Music')" , connection)
df

                                                title  ...  categoryitems
0                           Rip it Up and Start Again  ...             13
1   Our Band Could Be Your Life: Scenes from the A...  ...             13
2                                     How Music Works  ...             13
3                       Love Is a Mix Tape (Music #1)  ...             13
4   Please Kill Me: The Uncensored Oral History of...  ...             13
5   Kill 'Em and Leave: Searching for James Brown ...  ...             13
6   This Is Your Brain on Music: The Science of a ...  ...             13
7                                          Ahmed Book  ...             13
8                          No One Here Gets Out Alive  ...             13
9                                                Life  ...             13
10                   Forever Rockers (The Rocker #12)  ...             13

[11 rows x 7 columns]